MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140J8/mcu.h
typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t PCL                        : 1;
} stc_msc_uart_cr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t PS                         : 1;
    __IO uint8_t PE                         : 1;
    __IO uint8_t INV                        : 1;
    __IO uint8_t ESBLS                      : 1;
    __IO uint8_t FCEB                       : 1;
} stc_msc_uart_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    __IO uint8_t FEF                        : 1;
    __IO uint8_t PEF                        : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_uart_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
    __IO uint16_t EXT                       : 1;
} stc_msc_uart_brs_field_t;

typedef struct
{
    __IO uint16_t COMP                      :10;
    uint16_t RESERVED10                     : 5;
    __IO uint16_t CE                        : 1;
} stc_msc_uart_comp_field_t;

typedef struct
{
    __IO uint32_t AC_ST                     :32;
} stc_mtb_dwt_acstr_field_t;

typedef struct
{
    __IO uint32_t DC_ST                     :32;
} stc_mtb_dwt_dcstr_field_t;

typedef struct
{
    __IO uint32_t MDC_ST                    :32;
} stc_mtb_dwt_mdcstr_field_t;

typedef struct
{
    __IO uint32_t AC_SP                     :32;
} stc_mtb_dwt_acspr_field_t;

typedef struct
{
    __IO uint32_t DC_SP                     :32;
} stc_mtb_dwt_dcspr_field_t;

typedef struct
{
    __IO uint32_t MDC_SP                    :32;
} stc_mtb_dwt_mdcspr_field_t;

typedef struct
{
    __IO uint8_t STAEN                      : 2;
    __IO uint8_t STPEN                      : 2;
    __IO uint8_t DSTA                       : 2;
    __IO uint8_t DSTP                       : 2;
} stc_mtb_dwt_fct_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid4_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid5_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid6_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid7_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid0_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid1_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid2_field_t;

typedef struct
{
    __IO uint32_t PERID                     :32;
} stc_mtb_dwt_pid3_field_t;

typedef struct
{
    __IO uint32_t CPNTID                    :32;
} stc_mtb_dwt_cid0_field_t;

typedef struct
{
    __IO uint32_t CPNTID                    :32;
} stc_mtb_dwt_cid1_field_t;

typedef struct
{
    __IO uint32_t CPNTID                    :32;
} stc_mtb_dwt_cid2_field_t;

typedef struct
{
    __IO uint32_t CPNTID                    :32;
} stc_mtb_dwt_cid3_field_t;

typedef struct
{
    __IO uint8_t OPA_EN                     : 1;
} stc_opa_ctl_field_t;

typedef struct
{
    __IO uint32_t TRMKEY                    :32;
} stc_osc_ctl_hicr_trmkey_field_t;

typedef struct
{
    __IO uint32_t CR4MFTRM                  : 8;
} stc_osc_ctl_hicr_ftrm_field_t;

typedef struct
{
    __IO uint32_t CR4MTTRM                  : 4;
} stc_osc_ctl_hicr_ttrm_field_t;

typedef struct
{
    __IO uint8_t FDIV                       : 3;
} stc_osc_ctl_hicr_fdiv_field_t;

typedef struct
{
    __IO uint32_t HXSEL                     : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t HIBS                      : 2;
} stc_osc_ctl_hsxt_pwrctl_field_t;

typedef struct
{
    uint32_t RESERVED0                      :16;
    __IO uint32_t LIBS                      : 3;
} stc_osc_ctl_lsxt_pwrctl_field_t;

typedef struct
{
    __IO uint8_t PE                         : 1;
    __IO uint8_t PIE                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t PERROR                     : 1;
} stc_parity_ctl_field_t;

typedef struct
{
    __IO uint32_t ADDR                      :32;
} stc_parity_addr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t MSC4CK                    : 1;
    __IO uint32_t MSC5CK                    : 1;
    __IO uint32_t MSC6CK                    : 1;
    uint32_t RESERVED7                      : 9;
    __IO uint32_t ADCCK                     : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t DMACK                     : 1;
    uint32_t RESERVED25                     : 3;
    __IO uint32_t GIOCK                     : 1;
} stc_pcg_clken0_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t MSC4RST                   : 1;
    __IO uint32_t MSC5RST                   : 1;
    __IO uint32_t MSC6RST                   : 1;
    uint32_t RESERVED7                      : 9;
    __IO uint32_t ADCRST                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t DMARST                    : 1;
} stc_pcg_rstctl0_field_t;

typedef struct
{
    __IO uint32_t CTCK                      : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t VCCK                      : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t TM4CK                     : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t OPA0CK                    : 1;
    __IO uint32_t OPA1CK                    : 1;
} stc_pcg_clken1_field_t;

typedef struct
{
    __IO uint32_t CTMRST                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t VCRST                     : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t TM4RST                    : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t OPA0RST                   : 1;
    __IO uint32_t OPA1RST                   : 1;
} stc_pcg_rstctl1_field_t;

typedef struct
{
    uint32_t RESERVED0                      :16;
    __IO uint32_t LCDCCK                    : 1;
} stc_pcg_clken2_field_t;

typedef struct
{
    uint32_t RESERVED0                      :16;
    __IO uint32_t LCDCRST                   : 1;
} stc_pcg_rstctl2_field_t;

typedef struct
{
    __IO uint8_t IE                         : 1;
    __IO uint8_t RSTEN                      : 1;
    __IO uint8_t TMWD                       : 2;
    __IO uint8_t WDM                        : 1;
} stc_swwdt_wdt_ctl_field_t;

typedef struct
{
    __IO uint8_t STA                        : 1;
} stc_swwdt_wdt_sta_field_t;

typedef struct
{
    __IO uint8_t TRG                        : 1;
} stc_swwdt_wdt_mdc_field_t;

typedef struct
{
    __IO uint8_t OCE0                       : 1;
    __IO uint8_t OCE1                       : 1;
    __IO uint8_t OCP0                       : 1;
    __IO uint8_t OCP1                       : 1;
    __IO uint8_t OCIE0                      : 1;
    __IO uint8_t OCIE1                      : 1;
    __IO uint8_t OCF0                       : 1;
    __IO uint8_t OCF1                       : 1;
} stc_timer4_ocsr10_field_t;

typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer10_field_t;

typedef struct
{
    __IO uint8_t OCE0                       : 1;
    __IO uint8_t OCE1                       : 1;
    __IO uint8_t OCP0                       : 1;
    __IO uint8_t OCP1                       : 1;
    __IO uint8_t OCIE0                      : 1;
    __IO uint8_t OCIE1                      : 1;
    __IO uint8_t OCF0                       : 1;
    __IO uint8_t OCF1                       : 1;
} stc_timer4_ocsr32_field_t;

typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer32_field_t;

typedef struct
{
    __IO uint8_t OCE0                       : 1;
    __IO uint8_t OCE1                       : 1;
    __IO uint8_t OCP0                       : 1;
    __IO uint8_t OCP1                       : 1;
    __IO uint8_t OCIE0                      : 1;
    __IO uint8_t OCIE1                      : 1;
    __IO uint8_t OCF0                       : 1;
    __IO uint8_t OCF1                       : 1;
} stc_timer4_ocsr54_field_t;

typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer54_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr0_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr1_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr2_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr3_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr4_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr5_field_t;

typedef struct
{
    __IO uint16_t DCLK                      : 4;
    __IO uint16_t CLEAR                     : 1;
    __IO uint16_t CNTMD                     : 1;
    __IO uint16_t STOP                      : 1;
    __IO uint16_t BUFEN                     : 1;
    __IO uint16_t ICLEN                     : 1;
    __IO uint16_t ICLR                      : 1;
    uint16_t RESERVED10                     : 3;
    __IO uint16_t IRQZEN                    : 1;
    __IO uint16_t IRQZF                     : 1;
    __IO uint16_t ECKEN                     : 1;
} stc_timer4_ccsr_field_t;

typedef struct
{
    __IO uint16_t ZIM                       : 4;
    __IO uint16_t PIM                       : 4;
    __IO uint16_t ZIC                       : 4;
    __IO uint16_t PIC                       : 4;
} stc_timer4_cimr_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr10_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr32_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr54_field_t;

typedef struct
{
    __IO uint16_t RTID10                    : 1;
    __IO uint16_t RTID32                    : 1;
    __IO uint16_t RTID54                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RTIF10                    : 1;
    __IO uint16_t RTIC10                    : 1;
    __IO uint16_t RTE10                     : 1;
    __IO uint16_t RTS10                     : 1;
    __IO uint16_t RTIF32                    : 1;
    __IO uint16_t RTIC32                    : 1;
    __IO uint16_t RTE32                     : 1;
    __IO uint16_t RTS32                     : 1;
    __IO uint16_t RTIF54                    : 1;
    __IO uint16_t RTIC54                    : 1;
    __IO uint16_t RTE54                     : 1;
    __IO uint16_t RTS54                     : 1;
} stc_timer4_rcsr_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr0_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater0_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr0_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr1_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater1_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr1_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr2_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater2_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr2_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr3_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater3_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr3_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr4_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater4_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr4_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr5_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater5_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr5_field_t;

typedef struct
{
    __IO uint16_t DPE                       : 1;
    __IO uint16_t NCS                       : 3;
    __IO uint16_t SDI                       : 1;
    __IO uint16_t APE                       : 1;
    uint16_t RESERVED6                      : 1;
    __IO uint16_t HOLD                      : 1;
    __IO uint16_t DID                       : 1;
    __IO uint16_t AID                       : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DIF                       : 1;
    __IO uint16_t DIFC                      : 1;
    __IO uint16_t AIF                       : 1;
    __IO uint16_t AIFC                      : 1;
} stc_timer4_escr_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr0_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr1_field_t;

typedef struct
{
    __IO uint32_t UID                       :16;
} stc_uid_uidr2_field_t;

typedef struct
{
    __IO uint8_t VC_EN                      : 1;
    __IO uint8_t VC_OUT                     : 1;
    __IO uint8_t VC_NMODE                   : 1;
    __IO uint8_t VC_COMPSL                  : 2;
} stc_vc_ctl1_field_t;

typedef struct
{
    __IO uint16_t VC_FILTER_EN              : 1;
    __IO uint16_t VC_RESPONSE               : 3;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t VCINT_EDGE                : 2;
    __IO uint16_t VCINT_HIGH                : 1;
    __IO uint16_t VC2PT                     : 1;
    __IO uint16_t VCIE                      : 1;
    __IO uint16_t VCIF                      : 1;
    __IO uint16_t VC_HYS_SEL                : 1;
} stc_vc_ctl2_field_t;

typedef struct
{
    __IO uint8_t VC_TM0G                    : 1;
    __IO uint8_t VC_TM2G                    : 1;
} stc_vc_ctl3_field_t;

typedef struct
{
    __IO uint32_t LVD1_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD1_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD1_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD1_EN                   : 1;
} stc_wsunit_lvd1_set_field_t;

typedef struct
{
    __IO uint32_t LVD1_IF                   : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_IF                   : 1;
} stc_wsunit_lvd_int_str_field_t;

typedef struct
{
    __IO uint32_t LVD1_CLR                  : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_CLR                  : 1;
} stc_wsunit_lvd_clr_field_t;

typedef struct
{
    __IO uint32_t LVD2_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD2_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD2_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD2_EN                   : 1;
} stc_wsunit_lvd2_set_field_t;

typedef struct
{
    __IO uint8_t BUR01                      : 8;
} stc_wsunit_bur01_field_t;

typedef struct
{
    __IO uint8_t BUR02                      : 8;
} stc_wsunit_bur02_field_t;

typedef struct
{
    __IO uint8_t BUR03                      : 8;
} stc_wsunit_bur03_field_t;

typedef struct
{
    __IO uint8_t BUR04                      : 8;
} stc_wsunit_bur04_field_t;

typedef struct
{
    __IO uint8_t BUR05                      : 8;
} stc_wsunit_bur05_field_t;

typedef struct
{
    __IO uint8_t BUR06                      : 8;
} stc_wsunit_bur06_field_t;

typedef struct
{
    __IO uint8_t BUR07                      : 8;
} stc_wsunit_bur07_field_t;

typedef struct
{
    __IO uint8_t BUR08                      : 8;
} stc_wsunit_bur08_field_t;

typedef struct
{
    __IO uint8_t BUR09                      : 8;
} stc_wsunit_bur09_field_t;

typedef struct
{
    __IO uint8_t BUR10                      : 8;
} stc_wsunit_bur10_field_t;

typedef struct
{
    __IO uint8_t BUR11                      : 8;
} stc_wsunit_bur11_field_t;

typedef struct
{
    __IO uint8_t BUR12                      : 8;
} stc_wsunit_bur12_field_t;

typedef struct
{
    __IO uint8_t BUR13                      : 8;
} stc_wsunit_bur13_field_t;

typedef struct
{
    __IO uint8_t BUR14                      : 8;
} stc_wsunit_bur14_field_t;

typedef struct
{
    __IO uint8_t BUR15                      : 8;
} stc_wsunit_bur15_field_t;

typedef struct
{
    __IO uint8_t BUR16                      : 8;
} stc_wsunit_bur16_field_t;


