MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140J8/mcu.h
#define bM0P_CT2_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1198UL))
#define bM0P_CT2_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A119CUL))
#define bM0P_CT2_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A11A0UL))
#define bM0P_CT2_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A11A4UL))
#define bM0P_CT2_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A11A8UL))
#define bM0P_CT2_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A11B0UL))
#define bM0P_CT2_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A11B4UL))
#define bM0P_CT2_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A11B8UL))
#define bM0P_CT2_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A1200UL))
#define bM0P_CT2_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A1208UL))
#define bM0P_CT2_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A1210UL))
#define bM0P_CT2_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A1218UL))
#define bM0P_CT2_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A121CUL))
#define bM0P_CT2_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1220UL))
#define bM0P_CT3_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1984UL))
#define bM0P_CT3_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A1988UL))
#define bM0P_CT3_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1990UL))
#define bM0P_CT3_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1994UL))
#define bM0P_CT3_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1998UL))
#define bM0P_CT3_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A199CUL))
#define bM0P_CT3_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A19A0UL))
#define bM0P_CT3_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A19A8UL))
#define bM0P_CT3_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A1A1CUL))
#define bM0P_CT3_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT0_PWM_TCR_START                          *((volatile unsigned int*)(0x424A0180UL))
#define bM0P_CT0_PWM_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0184UL))
#define bM0P_CT0_PWM_TCR_MODS                           *((volatile unsigned int*)(0x424A0188UL))
#define bM0P_CT0_PWM_TCR_PLRT                           *((volatile unsigned int*)(0x424A018CUL))
#define bM0P_CT0_PWM_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0190UL))
#define bM0P_CT0_PWM_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0194UL))
#define bM0P_CT0_PWM_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0198UL))
#define bM0P_CT0_PWM_TCR_EDGS0                          *((volatile unsigned int*)(0x424A01A0UL))
#define bM0P_CT0_PWM_TCR_EDGS1                          *((volatile unsigned int*)(0x424A01A4UL))
#define bM0P_CT0_PWM_TCR_MASK                           *((volatile unsigned int*)(0x424A01A8UL))
#define bM0P_CT0_PWM_TCR_RSTEN                          *((volatile unsigned int*)(0x424A01ACUL))
#define bM0P_CT0_PWM_TCR_CLKS0                          *((volatile unsigned int*)(0x424A01B0UL))
#define bM0P_CT0_PWM_TCR_CLKS1                          *((volatile unsigned int*)(0x424A01B4UL))
#define bM0P_CT0_PWM_TCR_CLKS2                          *((volatile unsigned int*)(0x424A01B8UL))
#define bM0P_CT0_PWM_STA_UDFIR                          *((volatile unsigned int*)(0x424A0200UL))
#define bM0P_CT0_PWM_STA_DTMIR                          *((volatile unsigned int*)(0x424A0204UL))
#define bM0P_CT0_PWM_STA_TRGIR                          *((volatile unsigned int*)(0x424A0208UL))
#define bM0P_CT0_PWM_STA_UDFIE                          *((volatile unsigned int*)(0x424A0210UL))
#define bM0P_CT0_PWM_STA_DTMIE                          *((volatile unsigned int*)(0x424A0214UL))
#define bM0P_CT0_PWM_STA_TRGIE                          *((volatile unsigned int*)(0x424A0218UL))
#define bM0P_CT0_PWM_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0220UL))
#define bM0P_CT1_PWM_TCR_START                          *((volatile unsigned int*)(0x424A0980UL))
#define bM0P_CT1_PWM_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0984UL))
#define bM0P_CT1_PWM_TCR_MODS                           *((volatile unsigned int*)(0x424A0988UL))
#define bM0P_CT1_PWM_TCR_PLRT                           *((volatile unsigned int*)(0x424A098CUL))
#define bM0P_CT1_PWM_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0990UL))
#define bM0P_CT1_PWM_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0994UL))
#define bM0P_CT1_PWM_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0998UL))
#define bM0P_CT1_PWM_TCR_EDGS0                          *((volatile unsigned int*)(0x424A09A0UL))
#define bM0P_CT1_PWM_TCR_EDGS1                          *((volatile unsigned int*)(0x424A09A4UL))
#define bM0P_CT1_PWM_TCR_MASK                           *((volatile unsigned int*)(0x424A09A8UL))
#define bM0P_CT1_PWM_TCR_RSTEN                          *((volatile unsigned int*)(0x424A09ACUL))
#define bM0P_CT1_PWM_TCR_CLKS0                          *((volatile unsigned int*)(0x424A09B0UL))
#define bM0P_CT1_PWM_TCR_CLKS1                          *((volatile unsigned int*)(0x424A09B4UL))
#define bM0P_CT1_PWM_TCR_CLKS2                          *((volatile unsigned int*)(0x424A09B8UL))
#define bM0P_CT1_PWM_STA_UDFIR                          *((volatile unsigned int*)(0x424A0A00UL))
#define bM0P_CT1_PWM_STA_DTMIR                          *((volatile unsigned int*)(0x424A0A04UL))
#define bM0P_CT1_PWM_STA_TRGIR                          *((volatile unsigned int*)(0x424A0A08UL))
#define bM0P_CT1_PWM_STA_UDFIE                          *((volatile unsigned int*)(0x424A0A10UL))
#define bM0P_CT1_PWM_STA_DTMIE                          *((volatile unsigned int*)(0x424A0A14UL))
#define bM0P_CT1_PWM_STA_TRGIE                          *((volatile unsigned int*)(0x424A0A18UL))
#define bM0P_CT1_PWM_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0A20UL))
#define bM0P_CT2_PWM_TCR_START                          *((volatile unsigned int*)(0x424A1180UL))
#define bM0P_CT2_PWM_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1184UL))
#define bM0P_CT2_PWM_TCR_MODS                           *((volatile unsigned int*)(0x424A1188UL))
#define bM0P_CT2_PWM_TCR_PLRT                           *((volatile unsigned int*)(0x424A118CUL))
#define bM0P_CT2_PWM_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1190UL))
#define bM0P_CT2_PWM_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1194UL))
#define bM0P_CT2_PWM_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1198UL))
#define bM0P_CT2_PWM_TCR_EDGS0                          *((volatile unsigned int*)(0x424A11A0UL))
#define bM0P_CT2_PWM_TCR_EDGS1                          *((volatile unsigned int*)(0x424A11A4UL))
#define bM0P_CT2_PWM_TCR_MASK                           *((volatile unsigned int*)(0x424A11A8UL))
#define bM0P_CT2_PWM_TCR_RSTEN                          *((volatile unsigned int*)(0x424A11ACUL))
#define bM0P_CT2_PWM_TCR_CLKS0                          *((volatile unsigned int*)(0x424A11B0UL))
#define bM0P_CT2_PWM_TCR_CLKS1                          *((volatile unsigned int*)(0x424A11B4UL))
#define bM0P_CT2_PWM_TCR_CLKS2                          *((volatile unsigned int*)(0x424A11B8UL))
#define bM0P_CT2_PWM_STA_UDFIR                          *((volatile unsigned int*)(0x424A1200UL))
#define bM0P_CT2_PWM_STA_DTMIR                          *((volatile unsigned int*)(0x424A1204UL))
#define bM0P_CT2_PWM_STA_TRGIR                          *((volatile unsigned int*)(0x424A1208UL))
#define bM0P_CT2_PWM_STA_UDFIE                          *((volatile unsigned int*)(0x424A1210UL))
#define bM0P_CT2_PWM_STA_DTMIE                          *((volatile unsigned int*)(0x424A1214UL))
#define bM0P_CT2_PWM_STA_TRGIE                          *((volatile unsigned int*)(0x424A1218UL))
#define bM0P_CT2_PWM_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1220UL))
#define bM0P_CT3_PWM_TCR_START                          *((volatile unsigned int*)(0x424A1980UL))
#define bM0P_CT3_PWM_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1984UL))
#define bM0P_CT3_PWM_TCR_MODS                           *((volatile unsigned int*)(0x424A1988UL))
#define bM0P_CT3_PWM_TCR_PLRT                           *((volatile unsigned int*)(0x424A198CUL))
#define bM0P_CT3_PWM_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1990UL))
#define bM0P_CT3_PWM_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1994UL))
#define bM0P_CT3_PWM_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1998UL))
#define bM0P_CT3_PWM_TCR_EDGS0                          *((volatile unsigned int*)(0x424A19A0UL))
#define bM0P_CT3_PWM_TCR_EDGS1                          *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_PWM_TCR_MASK                           *((volatile unsigned int*)(0x424A19A8UL))
#define bM0P_CT3_PWM_TCR_RSTEN                          *((volatile unsigned int*)(0x424A19ACUL))
#define bM0P_CT3_PWM_TCR_CLKS0                          *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_PWM_TCR_CLKS1                          *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_PWM_TCR_CLKS2                          *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_PWM_STA_UDFIR                          *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_PWM_STA_DTMIR                          *((volatile unsigned int*)(0x424A1A04UL))
#define bM0P_CT3_PWM_STA_TRGIR                          *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_PWM_STA_UDFIE                          *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_PWM_STA_DTMIE                          *((volatile unsigned int*)(0x424A1A14UL))
#define bM0P_CT3_PWM_STA_TRGIE                          *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_PWM_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT0_RT_TCR_START                           *((volatile unsigned int*)(0x424A0180UL))
#define bM0P_CT0_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A0184UL))
#define bM0P_CT0_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A0188UL))
#define bM0P_CT0_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A018CUL))
#define bM0P_CT0_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A0190UL))
#define bM0P_CT0_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A0194UL))
#define bM0P_CT0_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A0198UL))
#define bM0P_CT0_RT_TCR_T32                             *((volatile unsigned int*)(0x424A019CUL))
#define bM0P_CT0_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A01A0UL))
#define bM0P_CT0_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A01A4UL))
#define bM0P_CT0_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A01B0UL))
#define bM0P_CT0_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A01B4UL))
#define bM0P_CT0_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A01B8UL))
#define bM0P_CT0_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A0200UL))
#define bM0P_CT0_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A0208UL))
#define bM0P_CT0_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A0210UL))
#define bM0P_CT0_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A0218UL))
#define bM0P_CT0_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A0220UL))
#define bM0P_CT0_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A023CUL))
#define bM0P_CT1_RT_TCR_START                           *((volatile unsigned int*)(0x424A0980UL))
#define bM0P_CT1_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A0984UL))
#define bM0P_CT1_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A0988UL))
#define bM0P_CT1_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A098CUL))
#define bM0P_CT1_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A0990UL))
#define bM0P_CT1_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A0994UL))
#define bM0P_CT1_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A0998UL))
#define bM0P_CT1_RT_TCR_T32                             *((volatile unsigned int*)(0x424A099CUL))
#define bM0P_CT1_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A09A0UL))
#define bM0P_CT1_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A09A4UL))
#define bM0P_CT1_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A09B0UL))
#define bM0P_CT1_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A09B4UL))
#define bM0P_CT1_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A09B8UL))
#define bM0P_CT1_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A0A00UL))
#define bM0P_CT1_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A0A08UL))
#define bM0P_CT1_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A0A10UL))
#define bM0P_CT1_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A0A18UL))
#define bM0P_CT1_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A0A20UL))
#define bM0P_CT1_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A0A3CUL))
#define bM0P_CT2_RT_TCR_START                           *((volatile unsigned int*)(0x424A1180UL))
#define bM0P_CT2_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A1184UL))
#define bM0P_CT2_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A1188UL))
#define bM0P_CT2_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A118CUL))
#define bM0P_CT2_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A1190UL))
#define bM0P_CT2_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A1194UL))
#define bM0P_CT2_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A1198UL))
#define bM0P_CT2_RT_TCR_T32                             *((volatile unsigned int*)(0x424A119CUL))
#define bM0P_CT2_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A11A0UL))
#define bM0P_CT2_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A11A4UL))
#define bM0P_CT2_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A11B0UL))
#define bM0P_CT2_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A11B4UL))
#define bM0P_CT2_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A11B8UL))
#define bM0P_CT2_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A1200UL))
#define bM0P_CT2_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A1208UL))
#define bM0P_CT2_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A1210UL))
#define bM0P_CT2_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A1218UL))
#define bM0P_CT2_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A1220UL))
#define bM0P_CT2_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A123CUL))
#define bM0P_CT3_RT_TCR_START                           *((volatile unsigned int*)(0x424A1980UL))
#define bM0P_CT3_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A1984UL))
#define bM0P_CT3_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A1988UL))
#define bM0P_CT3_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A198CUL))
#define bM0P_CT3_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A1990UL))
#define bM0P_CT3_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A1994UL))
#define bM0P_CT3_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A1998UL))
#define bM0P_CT3_RT_TCR_T32                             *((volatile unsigned int*)(0x424A199CUL))
#define bM0P_CT3_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A19A0UL))
#define bM0P_CT3_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT3_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A1A3CUL))
#define bM0P_DMAC_CONF_HALT0                            *((volatile unsigned int*)(0x42C00060UL))
#define bM0P_DMAC_CONF_HALT1                            *((volatile unsigned int*)(0x42C00064UL))
#define bM0P_DMAC_CONF_HALT2                            *((volatile unsigned int*)(0x42C00068UL))
#define bM0P_DMAC_CONF_HALT3                            *((volatile unsigned int*)(0x42C0006CUL))
#define bM0P_DMAC_CONF_PRIO                             *((volatile unsigned int*)(0x42C00070UL))
#define bM0P_DMAC_CONF_ST                               *((volatile unsigned int*)(0x42C00078UL))
#define bM0P_DMAC_CONF_EN                               *((volatile unsigned int*)(0x42C0007CUL))
#define bM0P_DMAC_CONFA0_TC0                            *((volatile unsigned int*)(0x42C00200UL))
#define bM0P_DMAC_CONFA0_TC1                            *((volatile unsigned int*)(0x42C00204UL))
#define bM0P_DMAC_CONFA0_TC2                            *((volatile unsigned int*)(0x42C00208UL))
#define bM0P_DMAC_CONFA0_TC3                            *((volatile unsigned int*)(0x42C0020CUL))
#define bM0P_DMAC_CONFA0_TC4                            *((volatile unsigned int*)(0x42C00210UL))
#define bM0P_DMAC_CONFA0_TC5                            *((volatile unsigned int*)(0x42C00214UL))
#define bM0P_DMAC_CONFA0_TC6                            *((volatile unsigned int*)(0x42C00218UL))
#define bM0P_DMAC_CONFA0_TC7                            *((volatile unsigned int*)(0x42C0021CUL))
#define bM0P_DMAC_CONFA0_TC8                            *((volatile unsigned int*)(0x42C00220UL))
#define bM0P_DMAC_CONFA0_TC9                            *((volatile unsigned int*)(0x42C00224UL))
#define bM0P_DMAC_CONFA0_TC10                           *((volatile unsigned int*)(0x42C00228UL))
#define bM0P_DMAC_CONFA0_TC11                           *((volatile unsigned int*)(0x42C0022CUL))
#define bM0P_DMAC_CONFA0_TC12                           *((volatile unsigned int*)(0x42C00230UL))
#define bM0P_DMAC_CONFA0_TC13                           *((volatile unsigned int*)(0x42C00234UL))
#define bM0P_DMAC_CONFA0_TC14                           *((volatile unsigned int*)(0x42C00238UL))
#define bM0P_DMAC_CONFA0_TC15                           *((volatile unsigned int*)(0x42C0023CUL))
#define bM0P_DMAC_CONFA0_BC0                            *((volatile unsigned int*)(0x42C00240UL))
#define bM0P_DMAC_CONFA0_BC1                            *((volatile unsigned int*)(0x42C00244UL))
#define bM0P_DMAC_CONFA0_BC2                            *((volatile unsigned int*)(0x42C00248UL))
#define bM0P_DMAC_CONFA0_BC3                            *((volatile unsigned int*)(0x42C0024CUL))
#define bM0P_DMAC_CONFA0_TRI_SEL0                       *((volatile unsigned int*)(0x42C0025CUL))
#define bM0P_DMAC_CONFA0_TRI_SEL1                       *((volatile unsigned int*)(0x42C00260UL))
#define bM0P_DMAC_CONFA0_TRI_SEL2                       *((volatile unsigned int*)(0x42C00264UL))
#define bM0P_DMAC_CONFA0_TRI_SEL3                       *((volatile unsigned int*)(0x42C00268UL))
#define bM0P_DMAC_CONFA0_TRI_SEL4                       *((volatile unsigned int*)(0x42C0026CUL))
#define bM0P_DMAC_CONFA0_TRI_SEL5                       *((volatile unsigned int*)(0x42C00270UL))
#define bM0P_DMAC_CONFA0_ST                             *((volatile unsigned int*)(0x42C00274UL))
#define bM0P_DMAC_CONFA0_PAS                            *((volatile unsigned int*)(0x42C00278UL))
#define bM0P_DMAC_CONFA0_ENS                            *((volatile unsigned int*)(0x42C0027CUL))
#define bM0P_DMAC_CONFB0_MSK                            *((volatile unsigned int*)(0x42C00280UL))
#define bM0P_DMAC_CONFB0_STAT0                          *((volatile unsigned int*)(0x42C002C0UL))
#define bM0P_DMAC_CONFB0_STAT1                          *((volatile unsigned int*)(0x42C002C4UL))
#define bM0P_DMAC_CONFB0_STAT2                          *((volatile unsigned int*)(0x42C002C8UL))
#define bM0P_DMAC_CONFB0_FIS_IE                         *((volatile unsigned int*)(0x42C002CCUL))
#define bM0P_DMAC_CONFB0_ERR_IE                         *((volatile unsigned int*)(0x42C002D0UL))
#define bM0P_DMAC_CONFB0_RD                             *((volatile unsigned int*)(0x42C002D4UL))
#define bM0P_DMAC_CONFB0_RS                             *((volatile unsigned int*)(0x42C002D8UL))
#define bM0P_DMAC_CONFB0_RC                             *((volatile unsigned int*)(0x42C002DCUL))
#define bM0P_DMAC_CONFB0_FD                             *((volatile unsigned int*)(0x42C002E0UL))
#define bM0P_DMAC_CONFB0_FS                             *((volatile unsigned int*)(0x42C002E4UL))
#define bM0P_DMAC_CONFB0_WIDTH0                         *((volatile unsigned int*)(0x42C002E8UL))
#define bM0P_DMAC_CONFB0_WIDTH1                         *((volatile unsigned int*)(0x42C002ECUL))
#define bM0P_DMAC_CONFB0_MODE0                          *((volatile unsigned int*)(0x42C002F0UL))
#define bM0P_DMAC_CONFB0_MODE1                          *((volatile unsigned int*)(0x42C002F4UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR0                     *((volatile unsigned int*)(0x42C00300UL))
