MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140J8/mcu.h
#define bM0P_TIMER4_CCSR_IRQZF                          *((volatile unsigned int*)(0x42400938UL))
#define bM0P_TIMER4_CCSR_ECKEN                          *((volatile unsigned int*)(0x4240093CUL))
#define bM0P_TIMER4_CIMR_ZIM0                           *((volatile unsigned int*)(0x42400940UL))
#define bM0P_TIMER4_CIMR_ZIM1                           *((volatile unsigned int*)(0x42400944UL))
#define bM0P_TIMER4_CIMR_ZIM2                           *((volatile unsigned int*)(0x42400948UL))
#define bM0P_TIMER4_CIMR_ZIM3                           *((volatile unsigned int*)(0x4240094CUL))
#define bM0P_TIMER4_CIMR_PIM0                           *((volatile unsigned int*)(0x42400950UL))
#define bM0P_TIMER4_CIMR_PIM1                           *((volatile unsigned int*)(0x42400954UL))
#define bM0P_TIMER4_CIMR_PIM2                           *((volatile unsigned int*)(0x42400958UL))
#define bM0P_TIMER4_CIMR_PIM3                           *((volatile unsigned int*)(0x4240095CUL))
#define bM0P_TIMER4_CIMR_ZIC0                           *((volatile unsigned int*)(0x42400960UL))
#define bM0P_TIMER4_CIMR_ZIC1                           *((volatile unsigned int*)(0x42400964UL))
#define bM0P_TIMER4_CIMR_ZIC2                           *((volatile unsigned int*)(0x42400968UL))
#define bM0P_TIMER4_CIMR_ZIC3                           *((volatile unsigned int*)(0x4240096CUL))
#define bM0P_TIMER4_CIMR_PIC0                           *((volatile unsigned int*)(0x42400970UL))
#define bM0P_TIMER4_CIMR_PIC1                           *((volatile unsigned int*)(0x42400974UL))
#define bM0P_TIMER4_CIMR_PIC2                           *((volatile unsigned int*)(0x42400978UL))
#define bM0P_TIMER4_CIMR_PIC3                           *((volatile unsigned int*)(0x4240097CUL))
#define bM0P_TIMER4_POCR10_DIVCK0                       *((volatile unsigned int*)(0x42401300UL))
#define bM0P_TIMER4_POCR10_DIVCK1                       *((volatile unsigned int*)(0x42401304UL))
#define bM0P_TIMER4_POCR10_DIVCK2                       *((volatile unsigned int*)(0x42401308UL))
#define bM0P_TIMER4_POCR10_WMD0                         *((volatile unsigned int*)(0x42401310UL))
#define bM0P_TIMER4_POCR10_WMD1                         *((volatile unsigned int*)(0x42401314UL))
#define bM0P_TIMER4_POCR10_LVLS0                        *((volatile unsigned int*)(0x42401318UL))
#define bM0P_TIMER4_POCR10_LVLS1                        *((volatile unsigned int*)(0x4240131CUL))
#define bM0P_TIMER4_POCR32_DIVCK0                       *((volatile unsigned int*)(0x42401380UL))
#define bM0P_TIMER4_POCR32_DIVCK1                       *((volatile unsigned int*)(0x42401384UL))
#define bM0P_TIMER4_POCR32_DIVCK2                       *((volatile unsigned int*)(0x42401388UL))
#define bM0P_TIMER4_POCR32_WMD0                         *((volatile unsigned int*)(0x42401390UL))
#define bM0P_TIMER4_POCR32_WMD1                         *((volatile unsigned int*)(0x42401394UL))
#define bM0P_TIMER4_POCR32_LVLS0                        *((volatile unsigned int*)(0x42401398UL))
#define bM0P_TIMER4_POCR32_LVLS1                        *((volatile unsigned int*)(0x4240139CUL))
#define bM0P_TIMER4_POCR54_DIVCK0                       *((volatile unsigned int*)(0x42401400UL))
#define bM0P_TIMER4_POCR54_DIVCK1                       *((volatile unsigned int*)(0x42401404UL))
#define bM0P_TIMER4_POCR54_DIVCK2                       *((volatile unsigned int*)(0x42401408UL))
#define bM0P_TIMER4_POCR54_WMD0                         *((volatile unsigned int*)(0x42401410UL))
#define bM0P_TIMER4_POCR54_WMD1                         *((volatile unsigned int*)(0x42401414UL))
#define bM0P_TIMER4_POCR54_LVLS0                        *((volatile unsigned int*)(0x42401418UL))
#define bM0P_TIMER4_POCR54_LVLS1                        *((volatile unsigned int*)(0x4240141CUL))
#define bM0P_TIMER4_RCSR_RTID10                         *((volatile unsigned int*)(0x42401480UL))
#define bM0P_TIMER4_RCSR_RTID32                         *((volatile unsigned int*)(0x42401484UL))
#define bM0P_TIMER4_RCSR_RTID54                         *((volatile unsigned int*)(0x42401488UL))
#define bM0P_TIMER4_RCSR_RTIF10                         *((volatile unsigned int*)(0x42401490UL))
#define bM0P_TIMER4_RCSR_RTIC10                         *((volatile unsigned int*)(0x42401494UL))
#define bM0P_TIMER4_RCSR_RTE10                          *((volatile unsigned int*)(0x42401498UL))
#define bM0P_TIMER4_RCSR_RTS10                          *((volatile unsigned int*)(0x4240149CUL))
#define bM0P_TIMER4_RCSR_RTIF32                         *((volatile unsigned int*)(0x424014A0UL))
#define bM0P_TIMER4_RCSR_RTIC32                         *((volatile unsigned int*)(0x424014A4UL))
#define bM0P_TIMER4_RCSR_RTE32                          *((volatile unsigned int*)(0x424014A8UL))
#define bM0P_TIMER4_RCSR_RTS32                          *((volatile unsigned int*)(0x424014ACUL))
#define bM0P_TIMER4_RCSR_RTIF54                         *((volatile unsigned int*)(0x424014B0UL))
#define bM0P_TIMER4_RCSR_RTIC54                         *((volatile unsigned int*)(0x424014B4UL))
#define bM0P_TIMER4_RCSR_RTE54                          *((volatile unsigned int*)(0x424014B8UL))
#define bM0P_TIMER4_RCSR_RTS54                          *((volatile unsigned int*)(0x424014BCUL))
#define bM0P_TIMER4_ATCR0_BUFEN0                        *((volatile unsigned int*)(0x42401900UL))
#define bM0P_TIMER4_ATCR0_BUFEN1                        *((volatile unsigned int*)(0x42401904UL))
#define bM0P_TIMER4_ATCR0_ADTRGS0                       *((volatile unsigned int*)(0x42401908UL))
#define bM0P_TIMER4_ATCR0_ADTRGS1                       *((volatile unsigned int*)(0x4240190CUL))
#define bM0P_TIMER4_ATCR0_ADTRGS2                       *((volatile unsigned int*)(0x42401910UL))
#define bM0P_TIMER4_ATCR0_LMC                           *((volatile unsigned int*)(0x42401914UL))
#define bM0P_TIMER4_ATER0_TRGMD                         *((volatile unsigned int*)(0x42401920UL))
#define bM0P_TIMER4_ATER0_OCS                           *((volatile unsigned int*)(0x42401924UL))
#define bM0P_TIMER4_ATER0_DEN                           *((volatile unsigned int*)(0x42401930UL))
#define bM0P_TIMER4_ATER0_PEN                           *((volatile unsigned int*)(0x42401934UL))
#define bM0P_TIMER4_ATER0_UEN                           *((volatile unsigned int*)(0x42401938UL))
#define bM0P_TIMER4_ATER0_ZEN                           *((volatile unsigned int*)(0x4240193CUL))
#define bM0P_TIMER4_ATMR0_AMC0                          *((volatile unsigned int*)(0x42401940UL))
#define bM0P_TIMER4_ATMR0_AMC1                          *((volatile unsigned int*)(0x42401944UL))
#define bM0P_TIMER4_ATMR0_AMC2                          *((volatile unsigned int*)(0x42401948UL))
#define bM0P_TIMER4_ATMR0_AMC3                          *((volatile unsigned int*)(0x4240194CUL))
#define bM0P_TIMER4_ATMR0_MZCE                          *((volatile unsigned int*)(0x42401958UL))
#define bM0P_TIMER4_ATMR0_MPCE                          *((volatile unsigned int*)(0x4240195CUL))
#define bM0P_TIMER4_ATCR1_BUFEN0                        *((volatile unsigned int*)(0x42401980UL))
#define bM0P_TIMER4_ATCR1_BUFEN1                        *((volatile unsigned int*)(0x42401984UL))
#define bM0P_TIMER4_ATCR1_ADTRGS0                       *((volatile unsigned int*)(0x42401988UL))
#define bM0P_TIMER4_ATCR1_ADTRGS1                       *((volatile unsigned int*)(0x4240198CUL))
#define bM0P_TIMER4_ATCR1_ADTRGS2                       *((volatile unsigned int*)(0x42401990UL))
#define bM0P_TIMER4_ATCR1_LMC                           *((volatile unsigned int*)(0x42401994UL))
#define bM0P_TIMER4_ATER1_TRGMD                         *((volatile unsigned int*)(0x424019A0UL))
#define bM0P_TIMER4_ATER1_OCS                           *((volatile unsigned int*)(0x424019A4UL))
#define bM0P_TIMER4_ATER1_DEN                           *((volatile unsigned int*)(0x424019B0UL))
#define bM0P_TIMER4_ATER1_PEN                           *((volatile unsigned int*)(0x424019B4UL))
#define bM0P_TIMER4_ATER1_UEN                           *((volatile unsigned int*)(0x424019B8UL))
#define bM0P_TIMER4_ATER1_ZEN                           *((volatile unsigned int*)(0x424019BCUL))
#define bM0P_TIMER4_ATMR1_AMC0                          *((volatile unsigned int*)(0x424019C0UL))
#define bM0P_TIMER4_ATMR1_AMC1                          *((volatile unsigned int*)(0x424019C4UL))
#define bM0P_TIMER4_ATMR1_AMC2                          *((volatile unsigned int*)(0x424019C8UL))
#define bM0P_TIMER4_ATMR1_AMC3                          *((volatile unsigned int*)(0x424019CCUL))
#define bM0P_TIMER4_ATMR1_MZCE                          *((volatile unsigned int*)(0x424019D8UL))
#define bM0P_TIMER4_ATMR1_MPCE                          *((volatile unsigned int*)(0x424019DCUL))
#define bM0P_TIMER4_ATCR2_BUFEN0                        *((volatile unsigned int*)(0x42401A00UL))
#define bM0P_TIMER4_ATCR2_BUFEN1                        *((volatile unsigned int*)(0x42401A04UL))
#define bM0P_TIMER4_ATCR2_ADTRGS0                       *((volatile unsigned int*)(0x42401A08UL))
#define bM0P_TIMER4_ATCR2_ADTRGS1                       *((volatile unsigned int*)(0x42401A0CUL))
#define bM0P_TIMER4_ATCR2_ADTRGS2                       *((volatile unsigned int*)(0x42401A10UL))
#define bM0P_TIMER4_ATCR2_LMC                           *((volatile unsigned int*)(0x42401A14UL))
#define bM0P_TIMER4_ATER2_TRGMD                         *((volatile unsigned int*)(0x42401A20UL))
#define bM0P_TIMER4_ATER2_OCS                           *((volatile unsigned int*)(0x42401A24UL))
#define bM0P_TIMER4_ATER2_DEN                           *((volatile unsigned int*)(0x42401A30UL))
#define bM0P_TIMER4_ATER2_PEN                           *((volatile unsigned int*)(0x42401A34UL))
#define bM0P_TIMER4_ATER2_UEN                           *((volatile unsigned int*)(0x42401A38UL))
#define bM0P_TIMER4_ATER2_ZEN                           *((volatile unsigned int*)(0x42401A3CUL))
#define bM0P_TIMER4_ATMR2_AMC0                          *((volatile unsigned int*)(0x42401A40UL))
#define bM0P_TIMER4_ATMR2_AMC1                          *((volatile unsigned int*)(0x42401A44UL))
#define bM0P_TIMER4_ATMR2_AMC2                          *((volatile unsigned int*)(0x42401A48UL))
#define bM0P_TIMER4_ATMR2_AMC3                          *((volatile unsigned int*)(0x42401A4CUL))
#define bM0P_TIMER4_ATMR2_MZCE                          *((volatile unsigned int*)(0x42401A58UL))
#define bM0P_TIMER4_ATMR2_MPCE                          *((volatile unsigned int*)(0x42401A5CUL))
#define bM0P_TIMER4_ATCR3_BUFEN0                        *((volatile unsigned int*)(0x42401A80UL))
#define bM0P_TIMER4_ATCR3_BUFEN1                        *((volatile unsigned int*)(0x42401A84UL))
#define bM0P_TIMER4_ATCR3_ADTRGS0                       *((volatile unsigned int*)(0x42401A88UL))
#define bM0P_TIMER4_ATCR3_ADTRGS1                       *((volatile unsigned int*)(0x42401A8CUL))
#define bM0P_TIMER4_ATCR3_ADTRGS2                       *((volatile unsigned int*)(0x42401A90UL))
#define bM0P_TIMER4_ATCR3_LMC                           *((volatile unsigned int*)(0x42401A94UL))
#define bM0P_TIMER4_ATER3_TRGMD                         *((volatile unsigned int*)(0x42401AA0UL))
#define bM0P_TIMER4_ATER3_OCS                           *((volatile unsigned int*)(0x42401AA4UL))
#define bM0P_TIMER4_ATER3_DEN                           *((volatile unsigned int*)(0x42401AB0UL))
#define bM0P_TIMER4_ATER3_PEN                           *((volatile unsigned int*)(0x42401AB4UL))
#define bM0P_TIMER4_ATER3_UEN                           *((volatile unsigned int*)(0x42401AB8UL))
#define bM0P_TIMER4_ATER3_ZEN                           *((volatile unsigned int*)(0x42401ABCUL))
#define bM0P_TIMER4_ATMR3_AMC0                          *((volatile unsigned int*)(0x42401AC0UL))
#define bM0P_TIMER4_ATMR3_AMC1                          *((volatile unsigned int*)(0x42401AC4UL))
#define bM0P_TIMER4_ATMR3_AMC2                          *((volatile unsigned int*)(0x42401AC8UL))
#define bM0P_TIMER4_ATMR3_AMC3                          *((volatile unsigned int*)(0x42401ACCUL))
#define bM0P_TIMER4_ATMR3_MZCE                          *((volatile unsigned int*)(0x42401AD8UL))
#define bM0P_TIMER4_ATMR3_MPCE                          *((volatile unsigned int*)(0x42401ADCUL))
#define bM0P_TIMER4_ATCR4_BUFEN0                        *((volatile unsigned int*)(0x42401B00UL))
#define bM0P_TIMER4_ATCR4_BUFEN1                        *((volatile unsigned int*)(0x42401B04UL))
#define bM0P_TIMER4_ATCR4_ADTRGS0                       *((volatile unsigned int*)(0x42401B08UL))
#define bM0P_TIMER4_ATCR4_ADTRGS1                       *((volatile unsigned int*)(0x42401B0CUL))
#define bM0P_TIMER4_ATCR4_ADTRGS2                       *((volatile unsigned int*)(0x42401B10UL))
#define bM0P_TIMER4_ATCR4_LMC                           *((volatile unsigned int*)(0x42401B14UL))
#define bM0P_TIMER4_ATER4_TRGMD                         *((volatile unsigned int*)(0x42401B20UL))
#define bM0P_TIMER4_ATER4_OCS                           *((volatile unsigned int*)(0x42401B24UL))
#define bM0P_TIMER4_ATER4_DEN                           *((volatile unsigned int*)(0x42401B30UL))
#define bM0P_TIMER4_ATER4_PEN                           *((volatile unsigned int*)(0x42401B34UL))
#define bM0P_TIMER4_ATER4_UEN                           *((volatile unsigned int*)(0x42401B38UL))
#define bM0P_TIMER4_ATER4_ZEN                           *((volatile unsigned int*)(0x42401B3CUL))
#define bM0P_TIMER4_ATMR4_AMC0                          *((volatile unsigned int*)(0x42401B40UL))
#define bM0P_TIMER4_ATMR4_AMC1                          *((volatile unsigned int*)(0x42401B44UL))
#define bM0P_TIMER4_ATMR4_AMC2                          *((volatile unsigned int*)(0x42401B48UL))
#define bM0P_TIMER4_ATMR4_AMC3                          *((volatile unsigned int*)(0x42401B4CUL))
#define bM0P_TIMER4_ATMR4_MZCE                          *((volatile unsigned int*)(0x42401B58UL))
#define bM0P_TIMER4_ATMR4_MPCE                          *((volatile unsigned int*)(0x42401B5CUL))
#define bM0P_TIMER4_ATCR5_BUFEN0                        *((volatile unsigned int*)(0x42401B80UL))
#define bM0P_TIMER4_ATCR5_BUFEN1                        *((volatile unsigned int*)(0x42401B84UL))
#define bM0P_TIMER4_ATCR5_ADTRGS0                       *((volatile unsigned int*)(0x42401B88UL))
#define bM0P_TIMER4_ATCR5_ADTRGS1                       *((volatile unsigned int*)(0x42401B8CUL))
#define bM0P_TIMER4_ATCR5_ADTRGS2                       *((volatile unsigned int*)(0x42401B90UL))
#define bM0P_TIMER4_ATCR5_LMC                           *((volatile unsigned int*)(0x42401B94UL))
#define bM0P_TIMER4_ATER5_TRGMD                         *((volatile unsigned int*)(0x42401BA0UL))
#define bM0P_TIMER4_ATER5_OCS                           *((volatile unsigned int*)(0x42401BA4UL))
#define bM0P_TIMER4_ATER5_DEN                           *((volatile unsigned int*)(0x42401BB0UL))
#define bM0P_TIMER4_ATER5_PEN                           *((volatile unsigned int*)(0x42401BB4UL))
#define bM0P_TIMER4_ATER5_UEN                           *((volatile unsigned int*)(0x42401BB8UL))
#define bM0P_TIMER4_ATER5_ZEN                           *((volatile unsigned int*)(0x42401BBCUL))
#define bM0P_TIMER4_ATMR5_AMC0                          *((volatile unsigned int*)(0x42401BC0UL))
#define bM0P_TIMER4_ATMR5_AMC1                          *((volatile unsigned int*)(0x42401BC4UL))
#define bM0P_TIMER4_ATMR5_AMC2                          *((volatile unsigned int*)(0x42401BC8UL))
#define bM0P_TIMER4_ATMR5_AMC3                          *((volatile unsigned int*)(0x42401BCCUL))
#define bM0P_TIMER4_ATMR5_MZCE                          *((volatile unsigned int*)(0x42401BD8UL))
#define bM0P_TIMER4_ATMR5_MPCE                          *((volatile unsigned int*)(0x42401BDCUL))
#define bM0P_TIMER4_ESCR_DPE                            *((volatile unsigned int*)(0x42401E00UL))
#define bM0P_TIMER4_ESCR_NCS0                           *((volatile unsigned int*)(0x42401E04UL))
#define bM0P_TIMER4_ESCR_NCS1                           *((volatile unsigned int*)(0x42401E08UL))
#define bM0P_TIMER4_ESCR_NCS2                           *((volatile unsigned int*)(0x42401E0CUL))
#define bM0P_TIMER4_ESCR_SDI                            *((volatile unsigned int*)(0x42401E10UL))
#define bM0P_TIMER4_ESCR_APE                            *((volatile unsigned int*)(0x42401E14UL))
#define bM0P_TIMER4_ESCR_HOLD                           *((volatile unsigned int*)(0x42401E1CUL))
#define bM0P_TIMER4_ESCR_DID                            *((volatile unsigned int*)(0x42401E20UL))
#define bM0P_TIMER4_ESCR_AID                            *((volatile unsigned int*)(0x42401E24UL))
#define bM0P_TIMER4_ESCR_DIF                            *((volatile unsigned int*)(0x42401E30UL))
#define bM0P_TIMER4_ESCR_DIFC                           *((volatile unsigned int*)(0x42401E34UL))
#define bM0P_TIMER4_ESCR_AIF                            *((volatile unsigned int*)(0x42401E38UL))
#define bM0P_TIMER4_ESCR_AIFC                           *((volatile unsigned int*)(0x42401E3CUL))
#define bM0P_UID_UIDR0_UID0                             *((volatile unsigned int*)(0x42002000UL))
#define bM0P_UID_UIDR0_UID1                             *((volatile unsigned int*)(0x42002004UL))
#define bM0P_UID_UIDR0_UID2                             *((volatile unsigned int*)(0x42002008UL))
#define bM0P_UID_UIDR0_UID3                             *((volatile unsigned int*)(0x4200200CUL))
#define bM0P_UID_UIDR0_UID4                             *((volatile unsigned int*)(0x42002010UL))
#define bM0P_UID_UIDR0_UID5                             *((volatile unsigned int*)(0x42002014UL))
#define bM0P_UID_UIDR0_UID6                             *((volatile unsigned int*)(0x42002018UL))
#define bM0P_UID_UIDR0_UID7                             *((volatile unsigned int*)(0x4200201CUL))
#define bM0P_UID_UIDR0_UID8                             *((volatile unsigned int*)(0x42002020UL))
#define bM0P_UID_UIDR0_UID9                             *((volatile unsigned int*)(0x42002024UL))
#define bM0P_UID_UIDR0_UID10                            *((volatile unsigned int*)(0x42002028UL))
#define bM0P_UID_UIDR0_UID11                            *((volatile unsigned int*)(0x4200202CUL))
#define bM0P_UID_UIDR0_UID12                            *((volatile unsigned int*)(0x42002030UL))
#define bM0P_UID_UIDR0_UID13                            *((volatile unsigned int*)(0x42002034UL))
#define bM0P_UID_UIDR0_UID14                            *((volatile unsigned int*)(0x42002038UL))
#define bM0P_UID_UIDR0_UID15                            *((volatile unsigned int*)(0x4200203CUL))
#define bM0P_UID_UIDR0_UID16                            *((volatile unsigned int*)(0x42002040UL))
#define bM0P_UID_UIDR0_UID17                            *((volatile unsigned int*)(0x42002044UL))
#define bM0P_UID_UIDR0_UID18                            *((volatile unsigned int*)(0x42002048UL))
#define bM0P_UID_UIDR0_UID19                            *((volatile unsigned int*)(0x4200204CUL))
#define bM0P_UID_UIDR0_UID20                            *((volatile unsigned int*)(0x42002050UL))
#define bM0P_UID_UIDR0_UID21                            *((volatile unsigned int*)(0x42002054UL))
#define bM0P_UID_UIDR0_UID22                            *((volatile unsigned int*)(0x42002058UL))
#define bM0P_UID_UIDR0_UID23                            *((volatile unsigned int*)(0x4200205CUL))
#define bM0P_UID_UIDR0_UID24                            *((volatile unsigned int*)(0x42002060UL))
#define bM0P_UID_UIDR0_UID25                            *((volatile unsigned int*)(0x42002064UL))
#define bM0P_UID_UIDR0_UID26                            *((volatile unsigned int*)(0x42002068UL))
#define bM0P_UID_UIDR0_UID27                            *((volatile unsigned int*)(0x4200206CUL))
#define bM0P_UID_UIDR0_UID28                            *((volatile unsigned int*)(0x42002070UL))
#define bM0P_UID_UIDR0_UID29                            *((volatile unsigned int*)(0x42002074UL))
#define bM0P_UID_UIDR0_UID30                            *((volatile unsigned int*)(0x42002078UL))
#define bM0P_UID_UIDR0_UID31                            *((volatile unsigned int*)(0x4200207CUL))
#define bM0P_UID_UIDR1_UID0                             *((volatile unsigned int*)(0x42002080UL))
#define bM0P_UID_UIDR1_UID1                             *((volatile unsigned int*)(0x42002084UL))
#define bM0P_UID_UIDR1_UID2                             *((volatile unsigned int*)(0x42002088UL))
#define bM0P_UID_UIDR1_UID3                             *((volatile unsigned int*)(0x4200208CUL))
#define bM0P_UID_UIDR1_UID4                             *((volatile unsigned int*)(0x42002090UL))
#define bM0P_UID_UIDR1_UID5                             *((volatile unsigned int*)(0x42002094UL))
#define bM0P_UID_UIDR1_UID6                             *((volatile unsigned int*)(0x42002098UL))
#define bM0P_UID_UIDR1_UID7                             *((volatile unsigned int*)(0x4200209CUL))
#define bM0P_UID_UIDR1_UID8                             *((volatile unsigned int*)(0x420020A0UL))
#define bM0P_UID_UIDR1_UID9                             *((volatile unsigned int*)(0x420020A4UL))
#define bM0P_UID_UIDR1_UID10                            *((volatile unsigned int*)(0x420020A8UL))
#define bM0P_UID_UIDR1_UID11                            *((volatile unsigned int*)(0x420020ACUL))
#define bM0P_UID_UIDR1_UID12                            *((volatile unsigned int*)(0x420020B0UL))
#define bM0P_UID_UIDR1_UID13                            *((volatile unsigned int*)(0x420020B4UL))
#define bM0P_UID_UIDR1_UID14                            *((volatile unsigned int*)(0x420020B8UL))
#define bM0P_UID_UIDR1_UID15                            *((volatile unsigned int*)(0x420020BCUL))
#define bM0P_UID_UIDR1_UID16                            *((volatile unsigned int*)(0x420020C0UL))
#define bM0P_UID_UIDR1_UID17                            *((volatile unsigned int*)(0x420020C4UL))
#define bM0P_UID_UIDR1_UID18                            *((volatile unsigned int*)(0x420020C8UL))
#define bM0P_UID_UIDR1_UID19                            *((volatile unsigned int*)(0x420020CCUL))
#define bM0P_UID_UIDR1_UID20                            *((volatile unsigned int*)(0x420020D0UL))
#define bM0P_UID_UIDR1_UID21                            *((volatile unsigned int*)(0x420020D4UL))
#define bM0P_UID_UIDR1_UID22                            *((volatile unsigned int*)(0x420020D8UL))
#define bM0P_UID_UIDR1_UID23                            *((volatile unsigned int*)(0x420020DCUL))
#define bM0P_UID_UIDR1_UID24                            *((volatile unsigned int*)(0x420020E0UL))
#define bM0P_UID_UIDR1_UID25                            *((volatile unsigned int*)(0x420020E4UL))
#define bM0P_UID_UIDR1_UID26                            *((volatile unsigned int*)(0x420020E8UL))
#define bM0P_UID_UIDR1_UID27                            *((volatile unsigned int*)(0x420020ECUL))
#define bM0P_UID_UIDR1_UID28                            *((volatile unsigned int*)(0x420020F0UL))
#define bM0P_UID_UIDR1_UID29                            *((volatile unsigned int*)(0x420020F4UL))
#define bM0P_UID_UIDR1_UID30                            *((volatile unsigned int*)(0x420020F8UL))
#define bM0P_UID_UIDR1_UID31                            *((volatile unsigned int*)(0x420020FCUL))
#define bM0P_UID_UIDR2_UID0                             *((volatile unsigned int*)(0x42002100UL))
#define bM0P_UID_UIDR2_UID1                             *((volatile unsigned int*)(0x42002104UL))
#define bM0P_UID_UIDR2_UID2                             *((volatile unsigned int*)(0x42002108UL))
#define bM0P_UID_UIDR2_UID3                             *((volatile unsigned int*)(0x4200210CUL))
#define bM0P_UID_UIDR2_UID4                             *((volatile unsigned int*)(0x42002110UL))
